#### GetActivePredefinedSettings Method

---

|  |
| --- |
| ExportPDFSettings Class   See Also |

Gets the active settings element in the document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public static ExportPDFSettings GetActivePredefinedSettings( 	Document document ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetActivePredefinedSettings ( _ 	document As Document _ ) As ExportPDFSettings ``` |

| Visual C++ |
| --- |
| ``` public: static ExportPDFSettings^ GetActivePredefinedSettings( 	Document^ document ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document to find the active settings.

#### Return Value

The active settings, or    a null reference (  Nothing  in Visual Basic)  if none.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExportPDFSettings Class

Autodesk.Revit.DB Namespace